<template>
  <div id="app-about" class="container">
    <h3>О приложении</h3>
    <article>
      <p class="text-justify">
        &emsp;Приложение URL Shortener предназначено для удобного и быстрого
        создания коротких ссылок на любые интернет-ресурсы. Помимо генерации
        сокращённых URL,<br />приложение предоставляет расширенную статистику по
        формированию ссылок и анализу их&nbsp;популярности, представляя данные в
        виде наглядных графиков. Это помогает пользователям эффективно
        отслеживать активность и взаимодействие с созданными ссылками.
      </p>
      <p>
        &emsp;Проект создавался в целях отработки навыков создания REST-API
        приложений и изучения сопутствующих технологий. Проект реализован на
        современном стеке технологий:<br />&mdash; Flask для компактной
        серверной логики;<br />&mdash; Vue.js, Bootstrap и Chart.js для
        качественного UX/UI.
      </p>
    </article>
  </div>
</template>
